; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v1 ?v2)
             (pred_8 ?v4 ?v10)
             (pred_7 ?v1 ?v10)
             (pred_6 ?v13 ?v1 )
	     (pred_12 ?v1)
             (pred_5 ?v8)
             (pred_11 ?v4)
             (pred_4 ?v10)
             (pred_2 ?v1)
             (pred_10 ?v4)
             (pred_1 ?v1)
             (pred_3 ))



(:action op_1
:parameters (?v11 ?v7 ?v6 ?v3)
:precondition (and (pred_5 ?v11) (pred_5 ?v7) (pred_11 ?v6) (pred_4 ?v3)
          (pred_9 ?v11 ?v7) (pred_8 ?v6 ?v3)
                   (pred_7 ?v7 ?v3) (pred_12 ?v11) 
                   (pred_2 ?v7) (pred_10 ?v6))
:effect (and  (pred_1 ?v7) (not (pred_2 ?v7))))


(:action op_3
:parameters (?v11 ?v5)
:precondition (and (pred_5 ?v11) (pred_5 ?v5)
               (pred_12 ?v11) (pred_9 ?v11 ?v5) (pred_1 ?v5))
:effect (and (pred_12 ?v5) (not (pred_12 ?v11))))

(:action op_2
:parameters (?v11 ?v6)
:precondition (and (pred_5 ?v11) (pred_11 ?v6) 
                  (pred_12 ?v11) (pred_6 ?v6 ?v11) (pred_3 ))
:effect (and (pred_10 ?v6)
   (not (pred_6 ?v6 ?v11)) (not (pred_3 ))))


(:action op_4
:parameters (?v11 ?v12 ?v9)
:precondition (and (pred_5 ?v11) (pred_11 ?v12) (pred_11 ?v9)
                  (pred_12 ?v11) (pred_10 ?v9) (pred_6 ?v12 ?v11))
:effect (and (pred_10 ?v12) (pred_6 ?v9 ?v11)
        (not (pred_10 ?v9)) (not (pred_6 ?v12 ?v11))))

(:action op_5
:parameters (?v11 ?v6)
:precondition (and (pred_5 ?v11) (pred_11 ?v6) 
                  (pred_12 ?v11) (pred_10 ?v6))
:effect (and (pred_3 ) (pred_6 ?v6 ?v11) (not (pred_10 ?v6)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_17 obj_12 obj_32 obj_14 obj_19 obj_15 obj_27 obj_31 obj_20 obj_16 obj_23 obj_28 obj_03 obj_30 obj_01 obj_02 obj_26 obj_18 obj_25 obj_29 obj_22 obj_04 obj_05 obj_13 obj_09
    obj_08 obj_06 obj_24
    obj_07 obj_11 obj_21 obj_10
    )

    (:init
       (pred_3)

       (pred_5 obj_17)
       (pred_5 obj_12)
       (pred_5 obj_32)
       (pred_5 obj_14)
       (pred_5 obj_19)
       (pred_5 obj_15)
       (pred_5 obj_27)
       (pred_5 obj_31)
       (pred_5 obj_20)
       (pred_5 obj_16)
       (pred_5 obj_23)
       (pred_5 obj_28)
       (pred_5 obj_03)
       (pred_5 obj_30)
       (pred_5 obj_01)
       (pred_5 obj_02)
       (pred_5 obj_26)
       (pred_5 obj_18)
       (pred_5 obj_25)
       (pred_5 obj_29)
       (pred_5 obj_22)
       (pred_5 obj_04)
       (pred_5 obj_05)
       (pred_5 obj_13)
       (pred_5 obj_09)
       (pred_4 obj_08)
       (pred_4 obj_06)
       (pred_4 obj_24)
       (pred_11 obj_07)
       (pred_11 obj_11)
       (pred_11 obj_21)
       (pred_11 obj_10)

       (pred_9 obj_17 obj_15)
       (pred_9 obj_17 obj_12)
       (pred_9 obj_12 obj_27)
       (pred_9 obj_12 obj_32)
       (pred_9 obj_12 obj_17)
       (pred_9 obj_32 obj_31)
       (pred_9 obj_32 obj_14)
       (pred_9 obj_32 obj_12)
       (pred_9 obj_14 obj_20)
       (pred_9 obj_14 obj_19)
       (pred_9 obj_14 obj_32)
       (pred_9 obj_19 obj_16)
       (pred_9 obj_19 obj_14)
       (pred_9 obj_15 obj_23)
       (pred_9 obj_15 obj_27)
       (pred_9 obj_15 obj_17)
       (pred_9 obj_27 obj_28)
       (pred_9 obj_27 obj_31)
       (pred_9 obj_27 obj_12)
       (pred_9 obj_27 obj_15)
       (pred_9 obj_31 obj_03)
       (pred_9 obj_31 obj_20)
       (pred_9 obj_31 obj_32)
       (pred_9 obj_31 obj_27)
       (pred_9 obj_20 obj_30)
       (pred_9 obj_20 obj_16)
       (pred_9 obj_20 obj_14)
       (pred_9 obj_20 obj_31)
       (pred_9 obj_16 obj_01)
       (pred_9 obj_16 obj_19)
       (pred_9 obj_16 obj_20)
       (pred_9 obj_23 obj_02)
       (pred_9 obj_23 obj_28)
       (pred_9 obj_23 obj_15)
       (pred_9 obj_28 obj_26)
       (pred_9 obj_28 obj_03)
       (pred_9 obj_28 obj_27)
       (pred_9 obj_28 obj_23)
       (pred_9 obj_03 obj_18)
       (pred_9 obj_03 obj_30)
       (pred_9 obj_03 obj_31)
       (pred_9 obj_03 obj_28)
       (pred_9 obj_30 obj_25)
       (pred_9 obj_30 obj_01)
       (pred_9 obj_30 obj_20)
       (pred_9 obj_30 obj_03)
       (pred_9 obj_01 obj_29)
       (pred_9 obj_01 obj_16)
       (pred_9 obj_01 obj_30)
       (pred_9 obj_02 obj_22)
       (pred_9 obj_02 obj_26)
       (pred_9 obj_02 obj_23)
       (pred_9 obj_26 obj_04)
       (pred_9 obj_26 obj_18)
       (pred_9 obj_26 obj_28)
       (pred_9 obj_26 obj_02)
       (pred_9 obj_18 obj_05)
       (pred_9 obj_18 obj_25)
       (pred_9 obj_18 obj_03)
       (pred_9 obj_18 obj_26)
       (pred_9 obj_25 obj_13)
       (pred_9 obj_25 obj_29)
       (pred_9 obj_25 obj_30)
       (pred_9 obj_25 obj_18)
       (pred_9 obj_29 obj_09)
       (pred_9 obj_29 obj_01)
       (pred_9 obj_29 obj_25)
       (pred_9 obj_22 obj_04)
       (pred_9 obj_22 obj_02)
       (pred_9 obj_04 obj_05)
       (pred_9 obj_04 obj_26)
       (pred_9 obj_04 obj_22)
       (pred_9 obj_05 obj_13)
       (pred_9 obj_05 obj_18)
       (pred_9 obj_05 obj_04)
       (pred_9 obj_13 obj_09)
       (pred_9 obj_13 obj_25)
       (pred_9 obj_13 obj_05)
       (pred_9 obj_09 obj_29)
       (pred_9 obj_09 obj_13)
       (pred_2 obj_04)
       (pred_2 obj_26)
       (pred_2 obj_15)
       (pred_2 obj_20)
       (pred_7  obj_04 obj_08)
       (pred_7  obj_26 obj_06)
       (pred_7  obj_15 obj_24)
       (pred_7  obj_20 obj_06)
       (pred_1 obj_17)
       (pred_1 obj_12)
       (pred_1 obj_32)
       (pred_1 obj_14)
       (pred_1 obj_19)
       (pred_1 obj_27)
       (pred_1 obj_31)
       (pred_1 obj_16)
       (pred_1 obj_23)
       (pred_1 obj_28)
       (pred_1 obj_03)
       (pred_1 obj_30)
       (pred_1 obj_01)
       (pred_1 obj_02)
       (pred_1 obj_18)
       (pred_1 obj_25)
       (pred_1 obj_29)
       (pred_1 obj_22)
       (pred_1 obj_05)
       (pred_1 obj_13)
       (pred_1 obj_09)

       (pred_8  obj_07 obj_08)
       (pred_8  obj_11 obj_06)
       (pred_8  obj_21 obj_24)
       (pred_8  obj_10 obj_24)
       (pred_6 obj_07 obj_23)
       (pred_6 obj_11 obj_03)
       (pred_6 obj_21 obj_32)
       (pred_6 obj_10 obj_02)
       (pred_12 obj_13)
    )

    (:goal (and
       (pred_6 obj_07 obj_30)
       (pred_6 obj_21 obj_28)
    ))
(:constraints
  (always (not (pred_12 obj_25)))
)
)

; plan
1. (op_3 obj_13 obj_05)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_05)
   goals met: 0 of 2
2. (op_3 obj_05 obj_18)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_18)
   goals met: 0 of 2
3. (op_3 obj_18 obj_03)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_03)
   goals met: 0 of 2
4. (op_3 obj_03 obj_28)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_28)
   goals met: 0 of 2
5. (op_3 obj_28 obj_23)
   deleted: (pred_12 obj_28)
   added: (pred_12 obj_23)
   goals met: 0 of 2
6. (op_2 obj_23 obj_07)
   deleted: (pred_6 obj_07 obj_23) (pred_3)
   added: (pred_10 obj_07)
   goals met: 0 of 2
7. (op_3 obj_23 obj_28)
   deleted: (pred_12 obj_23)
   added: (pred_12 obj_28)
   goals met: 0 of 2
8. (op_3 obj_28 obj_03)
   deleted: (pred_12 obj_28)
   added: (pred_12 obj_03)
   goals met: 0 of 2
9. (op_3 obj_03 obj_30)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_30)
   goals met: 0 of 2
10. (op_5 obj_30 obj_07)
   deleted: (pred_10 obj_07)
   added: (pred_3) (pred_6 obj_07 obj_30)
   goals met: 1 of 2
11. (op_3 obj_30 obj_03)
   deleted: (pred_12 obj_30)
   added: (pred_12 obj_03)
   goals met: 1 of 2
12. (op_3 obj_03 obj_31)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_31)
   goals met: 1 of 2
13. (op_3 obj_31 obj_32)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_32)
   goals met: 1 of 2
14. (op_2 obj_32 obj_21)
   deleted: (pred_6 obj_21 obj_32) (pred_3)
   added: (pred_10 obj_21)
   goals met: 1 of 2
15. (op_3 obj_32 obj_12)
   deleted: (pred_12 obj_32)
   added: (pred_12 obj_12)
   goals met: 1 of 2
16. (op_3 obj_12 obj_27)
   deleted: (pred_12 obj_12)
   added: (pred_12 obj_27)
   goals met: 1 of 2
17. (op_3 obj_27 obj_28)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_28)
   goals met: 1 of 2
18. (op_5 obj_28 obj_21)
   deleted: (pred_10 obj_21)
   added: (pred_3) (pred_6 obj_21 obj_28)
   goals met: 2 of 2
